# Добавяне на багаж
# Мими има закупени самолетни билети, но в последствие решава да си добави багаж към тях.
# Таксите за багаж се изчисляват въз основа на теглото на чекирания багаж:
# до 10кг – 20% от цената на багаж над 20кг
# между 10кг и 20кг вкл. – 50% от цената на багаж над 20кг.
# над 20кг – таксата се чете от конзолата

# В зависимост от броя на дните, които остават до пътуването, цената се оскъпява:
# повече от 30 дни - цената на багажа се оскъпява с 10%
# между 7 и 30 дни вкл. - цената на багажа се оскъпява с 15%
# по-малко от 7 дни - цената на багажа се оскъпява с 40%
# Напишете програма, която пресмята колко ще трябва да заплати Мими, спрямо горните условия.

# Вход:
# От конзолата се четат 4 реда:
# Цената на багаж над 20кг - реално число в диапазона [10.0…80.0]
# Килограми на багажа – реално число в диапазона [1.0…32.0]
# Дни до пътуването – цяло число в диапазона [1…60]
# Брой багажи – цяло число в диапазона [1…10]
# Изход
# Да се отпечата на конзолата сумата, която ще трябва да заплати Мими за багажите, в следния формат:
# " The total price of bags is: {цената на багажите} lv. "
# Сумата да бъде форматирана до втората цифра след десетичния знак.
# Примерен вход и изход:

price_bag_above_20_kg: float = float(input())
bags_kg: float = float(input())
days_till_travel: int = int(input())
number_bags: int = int(input())
price: float = 0
final_price: float = 0

if bags_kg < 10:
    price = (price_bag_above_20_kg * 0.20) * number_bags
elif 10 <= bags_kg <= 20:
    price = (price_bag_above_20_kg * 0.50) * number_bags
elif bags_kg > 20:
    price = price_bag_above_20_kg * number_bags


if days_till_travel > 30:
    final_price = price + (price * 0.10)

elif 7 <= days_till_travel <= 30:
    final_price = price + (price * 0.15)

elif days_till_travel < 7:
    final_price = price + (price * 0.40)

print(f" The total price of bags is: {final_price:.2f} lv. ")