# Смени картинката на десктопа с друга


import ctypes

ctypes.windll.user32.SystemParametersInfoW(20, 0, "C:/Users/capit/Desktop/desktop_pics/checked/1919752.jpg", 0)

# Всички програмни езици могат да комуникират със стандартният за всички системи език C
# ctypes е вградена библиотека в езика python за комуникация с C
# windll - е под-библиотека (написана на C), която съществува само за windows и съдържа полезни функции за windows
# user32 - е модул (файл) който съдържа функции за управление на неща свързани с профила ти

# SystemParametersInfoW / SystemParametersInfoA - функция която изпълнява множество команди,
# една от които е да смени wallpaper:
#     - https://docs.microsoft.com/en-us/windows/win32/api/winuser/nf-winuser-systemparametersinfow
#     - Функцията очаква команда за първият параметър - командите са номерирани и командата за смяна на wallpaper:
#         - Microsoft са я кръстили SPI_SETDESKWALLPAPER и отговаря на числото 20
#             (в документацията им е 14 в шестнайсетична бройна система)
#     - Вторият и третият параметър на функцията се използват спрямо командата.
#         - В случая командата очаква текст като трети и нищо като 2ри затова слагаме 0 и после път до файл
#     - Четвъртата цифра отговаря на това дали искаме профилната настройка да се извести на други приложения в системата
#         - В случая не ни пука за други приложения в системата - 0 отговаря на false, различно от 0 отговаря на true

# Нямаш подсказки защото библиотеката не е написана на python

# Защо не сработи с SystemParametersInfoA - при А варианта оачаква текста да е в ASCII формат и това значи в string-а
# всеки символ да е само 1 byte
# По принцип в python 3 всички стрингове са закодирани с таблицата UTF-8 и затова всеки символ е 2 byte
# За да работи с SystemParametersInfoA трябва да укажем на python да направи string-а с 1 byte използвайки b"my text"

import ctypes

ctypes.windll.user32.SystemParametersInfoA(20, 0, b"C:/Users/capit/Desktop/desktop_pics/checked/1919752.jpg", 0)

