# Зоомагазин - Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.
# Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.
# Вход - от конзолата се четат 2 реда:
# Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
# Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
# Изход - на конзолата се отпечатва:  "{крайната сума} lv."

number_of_dog_food_packs = int (input())
number_of_cat_food_packs = int (input())
price_dog_food = 2.5
price_cat_food = 4

final_price = number_of_dog_food_packs * price_dog_food + number_of_cat_food_packs * price_cat_food
print(f"{final_price} lv.")