# Прогноза за времето – част 2
# Напишете програма, която при въведени градуси (реално число) принтира какво е времето, като имате предвид следната таблица:
# Градуси	Време
# 26.00 - 35.00	Hot
# 20.1 - 25.9	Warm
# 15.00 - 20.00	Mild
# 12.00 - 14.9	Cool
# 5.00 - 11.9	Cold
# Ако се въведат градуси, различни от посочените в таблицата, да се отпечата "unknown".

degree = float (input())

if 5.00 <= degree <= 11.9:
   print ("Cold")
elif 12.00 <= degree <= 14.9:
    print("Cool")
elif 15.00 <= degree <= 20.00:
    print ("Mild")
elif 20.1 <= degree <= 25.9:
    print ("Warm")
elif 26.00 <= degree <= 35.00:
    print ("Hot")
else:
    print ("unknown")