# ⦁	Пребоядисване
# Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
# ⦁	Предпазен найлон - 1.50 лв. за кв. метър
# ⦁	Боя - 14.50 лв. за литър
# ⦁	Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон,
# разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
# Вход -  входът се чете от конзолата и съдържа точно 4 реда:
# ⦁	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# ⦁	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# ⦁	Количество разредител (в литри) - цяло число в интервала [1…30]
# ⦁	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
# Изход - Да се отпечата на конзолата един ред:
# ⦁	"{сумата на всички разходи}"


#10% от количеството боя
#2 кв.м. найлон
# 1 час работа, е равна на 30% от сбора на всички разходи за материали


needed_nylon = int(input())
needed_paint = int(input())
needed_l_thinner = int(input())
hours_work = int(input())

price_nylon = 1.50
price_paint = 14.50
price_thinner = 5
price_bag = 0.40


nylon = needed_nylon + 2

paint = needed_paint / 100 * 10 + needed_paint # paint = needed_paint * 1.1

items_price = nylon * price_nylon + paint * price_paint + needed_l_thinner * price_thinner + price_bag

price_for_1_h_work = items_price / 100 * 30

salaries_workers = hours_work * price_for_1_h_work

final_price = salaries_workers + items_price

print(final_price)