# ⦁	Доставка на храна
# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# ⦁	Пилешко меню –  10.35 лв.
# ⦁	Меню с риба – 12.40 лв.
# ⦁	Вегетарианско меню  – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# ⦁	Брой пилешки менюта – цяло число в интервала [0 … 99]
# ⦁	Брой менюта с риба – цяло число в интервала [0 … 99]
# ⦁	Брой вегетариански менюта – цяло число в интервала [0 … 99]
# Изход
# Да се отпечата на конзолата един ред:  "{цена на поръчката}"

num_chicken_menus = int(input())
num_fish_menus = int(input())
num_vegi_menus = int(input())

chicken = 10.35
fish = 12.40
vegi = 8.15

meals = num_chicken_menus * chicken + num_fish_menus * fish + num_vegi_menus * vegi

desert = meals * 0.2

final_sum = meals + desert + 2.50

print(final_sum)