# ⦁	Баскетболно оборудване
# Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка. Напишете програма, която изчислява какви разходи ще има Джеси,
# ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка:
# ⦁	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# ⦁	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# ⦁	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# ⦁	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
# Вход
# От конзолата се четe 1 ред:
# ⦁	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
# Изход
# Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
# Примерен вход и изход

year_tax = int(input())

shoes = year_tax - (year_tax * 0.4)
uniform = shoes - (shoes * 0.2)
ball =uniform / 4
acc = ball / 5

final_price = year_tax + shoes + uniform + ball + acc

print (final_price)
