# ⦁	Сграда
# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени
# следните условия:
# ⦁	На всеки четен етаж има само офиси;
# ⦁	На всеки нечетен етаж има само апартаменти;
# ⦁	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите
# започват от 0;
# ⦁	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;
# ⦁	На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера им пише 'L', вместо
# 'А'. Ако има само един етаж, то има само големи апартаменти!
# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.

# end е optional аргумент, даваш им име, в случая край лепка следващия принт директно на същия ред

floors: int = int(input())
rooms: int = int(input())

for floor_num in range(floors, 0, -1):
    for room in range(0, rooms):
        if room > 0:
            print(" ", end="")

        if floor_num % 2 == 0 and floor_num != floors:
            print(f"O{floor_num}{room}", end="")
        elif floor_num % 2 != 0 and floor_num != floors:
            print(f"A{floor_num}{room}", end="")
        elif floor_num == floors:
            print(f"L{floor_num}{room}", end="")
    print()

