# Задача 1. Change бюро
# Преди време Петър си е купил биткойн. Сега ще ходи на екскурзия из Европа и ще му трябва евро.
# Освен биткойн има и китайски юанa. Той иска да обмени парите си в евро за екскурзията. Напишете програма,
# която да пресмята колко евро може да купи спрямо следните валутни курсове:

# 1 биткойн = 1168 лева.
# 1 китайски юан = 0.15 долара.
# 1 долар = 1.76 лева.
# 1 евро = 1.95 лева.

# Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро.

# Вход
# От конзолата се четат 3 числа:
# На първия ред – броят биткойни. Цяло число в интервала [0…20]
# На втория ред – броят китайски юана. Реално число в интервала [0.00… 50 000.00]
# На третия ред – комисионната. Реално число в интервала [0.00 ... 5.00]
# Изход
# На конзолата да се отпечата 1 число - резултатът от обмяната на валутите. Резултатът да се форматира до
# втората цифра след десетичната запетая.


bitcoin: int = int(input())
ch_money: float = float(input())
commission: float = float(input())

bitcoin_to_lv: float = bitcoin * 1168
bitcoin_to_euro: float = bitcoin_to_lv / 1.95

ch_money_to_dollars: float = ch_money * 0.15
ch_money_to_lv: float = ch_money_to_dollars * 1.76
ch_money_to_euro: float = ch_money_to_lv / 1.95

all_money: float = ch_money_to_euro + bitcoin_to_euro
price_commission = all_money / 100 * commission
final: float = all_money - price_commission
print(f"{final:.2f}")
