# ⦁	Баланс по сметка
# Напишете програма, която пресмята колко общо пари има в сметката, след като направите определен брой вноски.
# На всеки ред ще получавате сумата, която трябва да внесете в сметката, до получаване на команда  "NoMoreMoney ".
# При всяка получена сума на конзолата трябва да се извежда "Increase: " + сумата и тя да се прибавя в сметката.
# Ако получите число по-малко от 0 на конзолата трябва да се изведе "Invalid operation!"  и програмата да приключи.
# Когато програмата приключи трябва да се принтира "Total: " + общата сума в сметката форматирана до втория знак след
# десетичната запетая.

all_money: float = 0

money: str = input()
while money != "NoMoreMoney":

    if float(money) < 0:
        print("Invalid operation!")
        break

    print(f"Increase: {float(money):.2f}")
    all_money = all_money + float(money)
    money: str = input()

print(f"Total: {all_money:.2f}")

