# Задача 1. Котешка диета
# За да са здрави котките, храненето им трябва да следва определена диета.
# Напишете програма, която изчислява котешкото процентно разпределение на макроелементите в храната за един ден
# и пресмята колко средно калории дава един грам от тази храна.
# Макроелементите са: мазнини, протеини и въглехидрати.
# Разполагате с общия брой калории, които котката трябва да приеме за един ден.
# Известно е, че:
# 1 грам мазнини = 9 калории
# 1 грам протеини = 4 калории
# 1 грам въглехидрати = 4 калории
# За да разберете колко калории дава един грам храна на котката, ще трябва да направите изчисления с реалното тегло
# на храната, тъй като тя съдържа вода. Трябва да се изчислят грамовете на мазнините, протеините и въглехидратите.
# Тяхната сума дава общото тегло на храната и от него трябва да извадим процентите вода.
# Вход:
# От конзолата се прочитат 5 реда:
# Процент на мазнините - цяло число в интервала [0…100]
# Процент на протеините - цяло число в интервала [0…100]
# Процент на въглехидратите - цяло число в интервала [0…100]
# Общ брой калории - цяло число в интервала [1000…15000]
# Процент на съдържанието на вода - цяло число в интервала [0…100]
# Пояснение: Когато правим подобни изчисления с проценти има голям шанс резултатът да не е цяло число!
# Изход:
# На конзолата се отпечатва 1 ред:
# "{calories}"
# Резултатът трябва да бъде форматиран до четвъртия знак след десетичната запетая.

percentage_fat = int(input())
percentage_protein = int(input())
percentage_carbohydrates = int(input())
all_calories = int(input())
percentage_water = int(input())

one_cal = all_calories / 100

all_gr_fat = (percentage_fat * one_cal) / 9
all_gr_protein = (percentage_protein * one_cal) / 4
all_gr_carb = (percentage_carbohydrates * one_cal) / 4

food_weight = all_gr_fat + all_gr_protein + all_gr_carb
cal_for_one_gr = all_calories / food_weight

water = (cal_for_one_gr / 100) * percentage_water
calories = cal_for_one_gr - water

print(f"{calories:.4f}")


# Done - 100/100
