# Таблица за умножение
# Най-малкият син на семейство Иванови все още не знае таблицата за умножение.
# Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи.
# Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение.
# Поради особености на Вашата програма, тя взима цифрите на въведеното число в обратен ред.
# Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.
# Вход
# Входът е цяло трицифрено число в интервала [111…999].
# Изход
# Да се отпечатат на конзолата няколко на брой реда в следния формат:
# "{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
# Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!

number = input()[::-1]


for a in range(1, int(number[0]) + 1):
    for b in range(1, int(number[1]) + 1):
        for c in range(1, int(number[2]) + 1):
            result = a * b * c
            print(f"{a} * {b} * {c} = {result};")

# Done - 100/100
