# . Световна ранглиста по тенис
# Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията,
# на която е завършил в турнира. Има три варианта за завършване на турнир:
# ⦁	W - ако е победител получава 2000 точки
# ⦁	F - ако е финалист получава 1200 точки
# ⦁	SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с
# колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от
# турнирите е спечелил.
# Вход
# От конзолата първо се четат два реда:
# ⦁	Брой турнири, в които е участвал – цяло число в интервала [1…20]
# ⦁	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
# За всеки турнир се прочита отделен ред:
# ⦁	Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
# ⦁	"Final points: {брой точки след изиграните турнири}"
# ⦁	"Average points: {средно колко точки печели за турнир}"
# ⦁	"{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра
# след десетичния знак.

import math

num_competitions: int = int(input())
initial_points: int = int(input())

won_points: float = 0

win: int = 0
fin: int = 0
half_fin: int = 0

for competition in range(0, num_competitions):
    stage: str = input()
    if stage == "W":
        won_points += 2000
        win += 1
    elif stage == "F":
        won_points += 1200
        fin += 1
    elif stage == "SF":
        won_points += 720
        half_fin += 1

all_competitions: int = win + fin + half_fin

average_points: float = won_points / all_competitions
final_points: float = won_points + initial_points
won_comp: float = win / all_competitions * 100

print(f"Final points: {final_points}")
print(f"Average points: {math.floor(average_points)}")
print(f"{won_comp:.2f}%")








