# ⦁	Време + 15 минути
# Да се напише програма, която чете час и минути от 24-часово денонощие, въведени от потребителя и изчислява колко
# ще е часът след 15 минути. Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23,
# а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри. Минутите се изписват винаги с по
# две цифри, с водеща нула, когато е необходимо.


hour: int = int(input())
minutes: int = int(input())

time: int = hour * 60 + minutes
new_time: int = time + 15
new_min: int = new_time % 60
new_hour: float = new_time // 60

if new_hour > 23:
    new_hour = 0

print(f"{new_hour}:{new_min:02d}")

# DONE
