# ⦁	Световен рекорд по плуване
# Иван решава да подобри Световния рекорд по плуване на дълги разстояния.
# На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,
# разстоянието в метри, което трябва да преплува и времето в секунди, за което плува разстояние от 1 м.
# Да се напише програма, която изчислява дали се е справил със задачата, като се има предвид, че:
# съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди.
# Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
# резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд.
# Вход
# От конзолата се четат 3 реда:
# ⦁	Рекордът в секунди – реално число;
# ⦁	Разстоянието в метри – реално число;
# ⦁	Времето в секунди, за което плува разстояние от 1 м. - реално число.
# Изход
# Отпечатването на конзолата зависи от резултата:
# ⦁	Ако Иван е подобрил Световния рекорд (времето му е по-малко от рекорда) отпечатваме:
# ⦁	" Yes, he succeeded! The new world record is {времето на Иван} seconds."
# ⦁	Ако НЕ е подобрил рекорда (времето му е по-голямо или равно на рекорда) отпечатваме:
# ⦁	"No, he failed! He was {недостигащите секунди} seconds slower."
# Резултатът трябва да се форматира до втория знак след десетичната запетая.

# съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди. резултат закръгли надолу до най-близкото цяло число

import math

record_in_sec: float = float(input())
distance_in_meters: float = float(input())
time_in_sek_for_meter: float = float(input())


number_slow_downs: float = math.floor(distance_in_meters / 15) * 12.5
ivan_time: float = distance_in_meters * time_in_sek_for_meter + number_slow_downs

dif: float = abs(ivan_time - record_in_sec)

if ivan_time < record_in_sec:
    print(f"Yes, he succeeded! The new world record is {ivan_time:.2f} seconds.")
else:
    print(f"No, he failed! He was {dif:.2f} seconds slower.")

# DONE
